NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32ZG23/EFR32ZG23B011F512IM40.svd
        <register>
          <name>STATUS2</name>
          <description>No Description</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFCFFFF</resetMask>
          <fields>
            <field>
              <name>CHPWRACCUMUX</name>
              <description>Channel power</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BBSSMUX</name>
              <description>Actual Baseband Signal Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LRBLECI</name>
              <description>RXed packet's LR BLE coding indicator</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LR125k</name>
                  <description>FEC block 2 coded using C=8, 125kbps</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LR500k</name>
                  <description>FEC block 2 coded using C=2, 500kbps</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNCODEDPHY</name>
              <description>UNCODED PHY DET </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CODEDPHY</name>
              <description>CODED PHY DET </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTCOST</name>
              <description>TRECS demod real time cost</description>
              <bitOffset>18</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS3</name>
          <description>No Description</description>
          <addressOffset>0x020</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBPFOUTABS1</name>
              <description>Pre-filter Correlation Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BBPFOUTABS</name>
              <description>Pre-filter Correlation Output for BLR</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LRDSALIVE</name>
              <description>BLRDSA Prefilter above LRSPIKETHD</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COHDSALIVE</name>
              <description>COHDSA Prefilter above CDTH</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LRDSADET</name>
              <description>DSA prefilter above LRSPIKETHD</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COHDSADET</name>
              <description>DSA prefilter above CDTH</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNCSECPEAKABTH</name>
              <description>SYNC second peak above threshold</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOFTRSTDONE</name>
              <description>Soft reset done</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS4</name>
          <description>No Description</description>
          <addressOffset>0x024</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FF01FF</resetMask>
          <fields>
            <field>
              <name>ANT0RSSI</name>
              <description>ANT0 RSSI value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANT1RSSI</name>
              <description>ANT1 RSSI value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS5</name>
          <description>No Description</description>
          <addressOffset>0x028</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>RXRESTARTMAFLTDOUT</name>
              <description>RSSI MA filter output value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS6</name>
          <description>No Description</description>
          <addressOffset>0x02C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC00FFFFF</resetMask>
          <fields>
            <field>
              <name>ANT0CORR</name>
              <description>ANT0 Correlation value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANT1CORR</name>
              <description>ANT1 Correlation value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANT0OUT</name>
              <description>ANT0 OUTPUT</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANT1OUT</name>
              <description>ANT1 OUTPUT</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS7</name>
          <description>No Description</description>
          <addressOffset>0x030</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xBFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FDEVEST</name>
              <description>Frequency Deviation Error Estimation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEMODSOFT</name>
              <description>PHASE DEMOD Soft code</description>
              <bitOffset>6</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFEPHDIFF</name>
              <description>CEF PHASE DIFF INPUT</description>
              <bitOffset>19</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINCOSTPASS</name>
              <description>Min.COST Threshold Pass</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFEDSADET</name>
              <description>CFE-based DSA Detection</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMDETSTATUS</name>
          <description>No Description</description>
          <addressOffset>0x034</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1F0FFFFF</resetMask>
          <fields>
            <field>
              <name>TIMDETCORR</name>
              <description>Correlation value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMDETFREQOFFEST</name>
              <description>Frequency offset estimate</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMDETPREERRORS</name>
              <description>Preamble errors</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMDETPASS</name>
              <description>Timing detection pass</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMDETINDEX</name>
              <description>Timing detection index</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
