NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32ZG23/EFR32ZG23B011F512IM40.svd
        <register>
          <name>DFLCTRL</name>
          <description>No Description</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFF7F</resetMask>
          <fields>
            <field>
              <name>DFLMODE</name>
              <description>Dynamic Frame Length Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Dynamic Frame Length support is disabled, and the frame length is controlled by writing directly to the FRAMELENGTH field</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEBYTE</name>
                  <description>Dynamic Frame Length is enabled and located in a single byte over air. This byte is loaded into the least significant byte of the extracted length field</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEBYTEMSB</name>
                  <description>Dynamic Frame Length is enabled and located in a single byte over air. This byte is loaded into the most significant byte of the extracted length field</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUALBYTELSBFIRST</name>
                  <description>Dynamic Frame Length is enabled and located in two bytes over air, of which the least significant byte is transferred first</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUALBYTEMSBFIRST</name>
                  <description>Dynamic Frame Length is enabled and located in two bytes over air, of which the most significant byte is transferred first</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INFINITE</name>
                  <description>Dynamic Frame Length support is disabled, and infinite frame lengths are transmitted and received. RXABORT may be used  to abort active receive operations, while the TXDIS command (available in the RAC) may be used to abort active transmit operations.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOCKERROR</name>
                  <description>In transmit mode, the frame length must be written directly to the FRAMELENGTH field. In receive mode, data will be received  until a block decoding error is found.</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFLBITORDER</name>
              <description>Dynamic Frame Length Bit order</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Bit ordering is defined by the BITORDER field</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REVERSE</name>
                  <description>Bit ordering is reversed, compared to what is defined by the BITORDER field</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFLSHIFT</name>
              <description>Dynamic Frame Length bitshift</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFLOFFSET</name>
              <description>Length Field Offset Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFLBITS</name>
              <description>Length field number of bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MINLENGTH</name>
              <description>Minimum decoded length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFLINCLUDECRC</name>
              <description>Length field includes CRC values or not</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>The CRC values are not included in the frame length</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>The CRC values are included in the frame length</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFLBOIOFFSET</name>
              <description>Length Field Offset Value</description>
              <bitOffset>21</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAXLENGTH</name>
          <description>No Description</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00004FFF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>MAXLENGTH</name>
              <description>Max Frame Length Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INILENGTH</name>
              <description>Initial Frame Length Value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRFILTCTRL</name>
          <description>No Description</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FF07</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Address Filter Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRDCST00EN</name>
              <description>Broadcast Address 0x00 Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRDCSTFFEN</name>
              <description>Broadcast Address 0xFF Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Address</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATABUFFER</name>
          <description>No Description</description>
          <addressOffset>0x018</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>DATABUFFER</name>
              <description>Frame Controller data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WCNT</name>
          <description>No Description</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>WCNT</name>
              <description>Word Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WCNTCMP0</name>
          <description>No Description</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>FRAMELENGTH</name>
              <description>Word Counter Frame Length Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WCNTCMP1</name>
          <description>No Description</description>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>LENGTHFIELDLOC</name>
              <description>Length field location</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WCNTCMP2</name>
          <description>No Description</description>
          <addressOffset>0x028</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>ADDRFIELDLOC</name>
              <description>Address field location</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>No Description</description>
          <addressOffset>0x02C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003FFF</resetMask>
          <fields>
            <field>
              <name>RXABORT</name>
              <description>RX Abort</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FRAMEDETRESUME</name>
              <description>FRAMEDET resume</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INTERLEAVEWRITERESUME</name>
              <description>Interleaver write resume</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INTERLEAVEREADRESUME</name>
              <description>Interleaver read resume</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CONVRESUME</name>
              <description>Convolutional coder resume</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CONVTERMINATE</name>
              <description>Convolutional coder termination</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXSUBFRAMERESUME</name>
              <description>TX subframe resume</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INTERLEAVEINIT</name>
              <description>Interleaver initialization</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INTERLEAVECNTCLEAR</name>
              <description>Interleaver counter clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CONVINIT</name>
              <description>Convolutional coder initialize</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BLOCKINIT</name>
              <description>Block coder initialize</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STATEINIT</name>
              <description>FRC State initialize</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXRAWUNBLOCK</name>
              <description>Clear RXRAWBLOCKED status flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXPAUSERESUME</name>
              <description>RX pause on nth byte resume</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WHITECTRL</name>
          <description>No Description</description>
          <addressOffset>0x030</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001F7F</resetMask>
          <fields>
            <field>
              <name>FEEDBACKSEL</name>
              <description>LFSR Feedback selector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIT0</name>
                  <description>Select bit 0 as feedback</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT1</name>
                  <description>Select bit 1 as feedback</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT2</name>
                  <description>Select bit 2 as feedback</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT3</name>
                  <description>Select bit 3 as feedback</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT4</name>
                  <description>Select bit 4 as feedback</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT5</name>
                  <description>Select bit 5 as feedback</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT6</name>
                  <description>Select bit 6 as feedback</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT7</name>
                  <description>Select bit 7 as feedback</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT8</name>
                  <description>Select bit 8 as feedback</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT9</name>
                  <description>Select bit 9 as feedback</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT10</name>
                  <description>Select bit 10 as feedback</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT11</name>
                  <description>Select bit 11 as feedback</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT12</name>
                  <description>Select bit 12 as feedback</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT13</name>
                  <description>Select bit 13 as feedback</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT14</name>
                  <description>Select bit 14 as feedback</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT15</name>
                  <description>Select bit 15 as feedback</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Select data input as feedback</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Select zero as feedback</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Select one as feedback</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXLASTWORD</name>
                  <description>In transmit mode, the feedback is one during the last transmit word and zero otherwise. In receive mode, the feedback is always zero.</description>
                  <value>19</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XORFEEDBACK</name>
              <description>LFSR Feedback XOR setting</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIRECT</name>
                  <description>The signal defined by FEEDBACKSEL is used directly as Feedback.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOR</name>
                  <description>The signal defined by FEEDBACKSEL is XOR'ed with bit 15, and the result is used as Feedback</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Feedback is set to 0</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHROUTPUTSEL</name>
              <description>Shift Register Output Selector</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLOCKERRORCORRECT</name>
              <description>Block Errors Correction enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>Block decoding errors are not corrected, only the BLOCKERR interrupt is set on detection.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>Block decoding errors are attempted corrected by memory lookup tables. The BLOCKERR interrupt is also set on error detection.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WHITEPOLY</name>
          <description>No Description</description>
          <addressOffset>0x034</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>POLY</name>
              <description>Whitener Polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WHITEINIT</name>
          <description>No Description</description>
          <addressOffset>0x038</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>WHITEINIT</name>
              <description>Whitener Initial Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
