NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32ZG23/EFR32ZG23B011F512IM40.svd
        <register>
          <name>BCRDEMODOOK</name>
          <description></description>
          <addressOffset>0x33C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00A00C03</resetValue>
          <resetMask>0xFFFFFFEF</resetMask>
          <fields>
            <field>
              <name>OOKFRZEN</name>
              <description>OOKFRZEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAWGAIN</name>
              <description>RAWGAIN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOISEFLEST</name>
              <description>Noise Floore Estimation Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTRUNK</name>
              <description>PKD TRUNKATION DISABLE </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAFREQDWN</name>
              <description>MAFREQDWN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SQUELCLKEN</name>
              <description>Squelch bit clock enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BWPK</name>
              <description>BWPK</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ABPK</name>
              <description>ABOVE PEAK</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DECAYSWAL</name>
              <description>DECAYSWAL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DECAY</name>
              <description>DECAY</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTACK</name>
              <description>ATTACK</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SQUELCH</name>
              <description>SQUELCH</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAWNDEC</name>
              <description>RAW DATA DEC</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCRDEMODOOK</name>
              <description>BCR Demod OOK enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BCRDEMODAFC0</name>
          <description></description>
          <addressOffset>0x340</addressOffset>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xE000807F</resetMask>
          <fields>
            <field>
              <name>ZEROOFF</name>
              <description>ZERO OFFSET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LARGEFREQERR</name>
              <description>LARGEFREQERR</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFCGAINOVRFLW</name>
              <description>AFCGAINOVRFLW</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN2TBEST</name>
              <description>EN2TBEST</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENAFCCLKSW</name>
              <description>ENAFCCLKSW</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BCRDEMODAFC1</name>
          <description></description>
          <addressOffset>0x344</addressOffset>
          <access>read-write</access>
          <resetValue>0x10100012</resetValue>
          <resetMask>0xFFFCC0FF</resetMask>
          <fields>
            <field>
              <name>LGWAIT</name>
              <description>LGWAIT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHWAIT</name>
              <description>SHWAIT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEARSW</name>
              <description>GEARSW</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFCMAEN</name>
              <description>AFCMAEN</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENFZPMEND</name>
              <description>ENFZPMEND</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONFRZEN</name>
              <description>NONFRZEN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ONESHOTWAITCNT</name>
              <description>ONESHOTWAITCNT</description>
              <bitOffset>21</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ONESHOTAFCEN</name>
              <description>ONESHOTAFCEN</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SKIPPMDET</name>
              <description>SKIPPMDET</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMRSTEN</name>
              <description>PM RST Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENAFCFRZ</name>
              <description>ENAFCFRZ</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALFPHCOMP</name>
              <description>HALFPHCOMP</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENAFC</name>
              <description>ENAFC</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENFBPLL</name>
              <description>ENFBPLL</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BCRDEMOD4FSK0</name>
          <description></description>
          <addressOffset>0x348</addressOffset>
          <access>read-write</access>
          <resetValue>0x00B4299A</resetValue>
          <resetMask>0xC0FFFFFF</resetMask>
          <fields>
            <field>
              <name>THD4GFSK</name>
              <description>THD4GFSK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CODE4GFSK</name>
              <description>CODE4GFSK</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHCOMPBYP</name>
              <description>PHCOMPBYP</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN4GFSK</name>
              <description>Enable BCR demod 4GFSK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BCRDEMOD4FSK1</name>
          <description></description>
          <addressOffset>0x34C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000B1C</resetValue>
          <resetMask>0xC0FF7F7F</resetMask>
          <fields>
            <field>
              <name>PHCOMP4FSK0</name>
              <description>PHCOMP4FSK0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHCOMP4FSK1</name>
              <description>PHCOMP4FSK1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FDEVCOMPRATIO</name>
              <description>Freq. Dev. Comp. Ratio</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FDEVCOMPEN</name>
              <description>Freq. Dev. Comp. Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S2PMAP</name>
              <description>S2PMAP</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S2p_mapping0</name>
                  <description>{a1,a0}, {a3,a2}, {a5,a4}</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S2p_mapping1</name>
                  <description>{a0,a1}, {a2,a3}, {a4,a5}    </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S2p_mapping2</name>
                  <description>{a0,a_1},{a2,a1}, {a4,a3}</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S2p_mapping3</name>
                  <description>{a_1,,a0}, {a1,a2},{a3,a4}</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BCRDEMODANT</name>
          <description>Recommended not to be used.</description>
          <addressOffset>0x350</addressOffset>
          <access>read-write</access>
          <resetValue>0x10020000</resetValue>
          <resetMask>0x9FFF97E0</resetMask>
          <fields>
            <field>
              <name>SWANTTIMER</name>
              <description>SWANTTIMER</description>
              <bitOffset>5</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BECOEN</name>
              <description>BECO MODE Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SKIP2PHTHD</name>
              <description>SKIP2PHTHD</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANWAIT</name>
              <description>ANWAIT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGCGAINUPB</name>
              <description>AGC GAIN UP</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SKIP2PH</name>
              <description>SKIP2PH</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYP1P5</name>
              <description>BYP1P5</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT2PMTHD</name>
              <description>ANT2PMTHD</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCRDEMODANTDIV</name>
              <description>BCRDEMODANTDIV</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BCRDEMODRSSI</name>
          <description></description>
          <addressOffset>0x354</addressOffset>
          <access>read-write</access>
          <resetValue>0x60000020</resetValue>
          <resetMask>0xFE001DFF</resetMask>
          <fields>
            <field>
              <name>RSSIARRTHD</name>
              <description>RSSIARRTHD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSIMATAP</name>
              <description>RSSIMATAP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUTERSSICNT</name>
              <description>MUTERSSICNT</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRWOFFSET</name>
              <description>Power measurement  Offset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BCRDEMODARR0</name>
          <description></description>
          <addressOffset>0x358</addressOffset>
          <access>read-write</access>
          <resetValue>0x00600026</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCHPRDLO</name>
              <description>SCHPRDLO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EYEQUALEN</name>
              <description>EYEQUALEN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHPRDHI</name>
              <description>SCHPRDHI</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRRSTEN</name>
              <description>ARRRSTEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRTOLER</name>
              <description>ARRTOLER</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIFF0RSTEN</name>
              <description>DIFF0RSTEN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHSPIKETHD</name>
              <description>PHASE SPIKE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRDETTHD</name>
              <description>ARRDETTHD</description>
              <bitOffset>21</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHFRZEN</name>
              <description>SCHFRZEN</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EYEXESTEN</name>
              <description>EYEXESTEN</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EYEXESTFAST</name>
              <description>EYEXESTFAST</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRDETSRC</name>
              <description>ARR DET SRC</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRQPM</name>
              <description>ARRIVAL QUALIFY PM DET</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRDETEN</name>
              <description>ARRDETEN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BCRDEMODARR1</name>
          <description>No Description</description>
          <addressOffset>0x35C</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ARREYEQUAL</name>
              <description>ARREYEQUAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EYEOPENTHD</name>
              <description>Expected Deviation </description>
              <bitOffset>7</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYMBWMAX</name>
              <description>Expected MAX Duration </description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYMBWMIN</name>
              <description>Expected MIN Duration </description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCRCFESRC</name>
              <description>BCR CFE INPUT SOURCE</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CFEQUALTHD</name>
              <description>BCR Demod CFE Qualifer THRD</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KSICOMPEN</name>
              <description>BCR KSI COMP. ENABLE</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENCFEQUAL</name>
              <description>Enable BCE CFE Qualifer</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
